//Напишите программу,которая на вход принимает число и выдает его квадрат (число умноженное на число)
// например:
//4 -> 16
//-3 -> 9


Console.Clear();
Console.Clear();
Console.Write("Введите число: ");
int number =int.Parse(Console.ReadLine());

Console.WriteLine($"{Math.Pow(b, 2) == a}");
if(Math.Pow(b, 2) == a)
{
    Console.WriteLine("a квадрат b");
}
else
{
    Console.WriteLine("a не квадрат b");
